//
//  q.swift
//  constitution
//
//  Created by 陳鍵群 on 2017/8/23.
//  Copyright © 2017年 陳鍵群. All rights reserved.
//

import UIKit

class Data: NSObject {
    
    let symptomArray: [String] = [
        "手腳冰冷", "鼻子過敏、鼻涕倒流", "皮膚過敏", "頻尿、夜尿", "排便鬆散或不成形",
        "流眼油", "腰酸", "分泌物多", "婦科易發炎", "經痛",
        "早上起床有眼屎", "眼睛容易乾、酸、癢", "口乾舌燥", "口臭", "容易嘴破",
        "大便顏色深、硬", "易怒、無名火、暴躁", "淺眠", "失眠", "膚色暗沈、臉上長斑",
        "臉上容易出油、長痘痘", "長瘜肉、脂肪瘤", "胃悶、胃脹痛", "胃潰傷", "胃食道逆流",
        "脹氣", "胃發炎", "消化不良", "早上起床口苦", "乳房脹痛",
        "牙齦腫痛", "容易緊張焦慮", "羊屎便、有便意大不出來", "慢性便秘",
        "大便臭、黏、放屁臭", "唇乾、脫皮", "下唇紅", "手上老人斑", "小腿皮膚粗糙、冬天容易乾癢",
        "肛門紅腫、排便出血、痔瘡", "嘴饞", "餓、累、不耐煩", "氣虛、講話講久容易累、爬樓梯喘",
        "容易疲倦、早上賴床", "沒有便意、大不出來", "心悶、心律不整", "容易生悶氣、容易擔心", "難以入睡", "淺眠多夢",
        "頸部僵硬、痠痛", "睡到半夜腳抽筋", "半夜醒來難再入眠", "恍神、注意力不集中", "記憶力減退",
        "焦慮、不安", "不耐煩、怕吵", "便秘或腹瀉", "水腫", "早上起床眼皮或眼袋浮腫",
        "溫度或情緒劇烈變化時容易偏頭痛、肩頸痠痛或血壓升高", "掉髮、頭髮變白", "慢性胃發炎", "尋麻疹", "香港腳(腳氣)",
        "髖關節卡卡", "毛囊炎(毛囊角質化)", "扁平疣", "牙齦出血", "婦科腫瘤",
        "心臟部位莫名疼痛", "失眠", "小腿皮膚乾燥粗糙", "羊屎便或排便不成形", "大便臭、黏",
        "粉刺", "痔瘡出血", "頭皮異常出油、頭皮屑、頭皮癢、掉髮", "男性雄性禿", "小朋友過動",
        "富貴手", "耳鳴", "耳朵莫名養", "肩頸僵硬痠痛", "淺眠多夢",
        "難以入眠", "青春痘", "痛風、尿酸過高", "思考無法集中", "情緒突然低落憂鬱",
        "上火", "白天昏昏欲睡"
    ]
    
    let physiqueArray: [String] = [
        "寒性體質", "上肝火體質", "陰虛火旺體質",
        "上胃火體質", "上腸火體質", "心臟無力體質",
        "鈣質流失體質", "腎虛體質", "奶類及其加工製品過敏體質",
        "蛋過敏體質", "黃豆及其加工製品過敏體質", "五穀雜糧過敏體質",
        "牛肉過敏體質"
    ]
    
    let howtoeat:[String] = ["要擁有溫暖體質，其實不難，只要忌口造成體質惡化的食物再加上認真喝薑汁和攝取優質蛋白質就可以了。但到底哪些食物會影響身體該忌口呢？\n\n忌口寒性食物\n蔬菜類：大白菜、小白菜、大黃瓜、苦瓜、絲瓜、冬瓜、地瓜葉、白蘿菠、秋葵。\n料理類：生菜沙拉、生魚片等生食\n\n第一步先避開寒性食物後，接著第二步，就是要好好認識哪些食物是會讓你身體上火的。根據身體不同的器官，上火的症狀和需要避開的食物也都不同",
        "內火有肝火和腸火。首先談談肝火，如果肝火過旺，你肯定會有睡眠的問題，不論是失眠、淺眠還是多夢，都與肝火有關。另外，肝火也會引發皮膚過敏。還有，早上起床時不時有眼屎，眼睛有乾、酸、癢的問題？會不會長針眼？有沒有嘴破手腳及臉部皮膚顏色會有暗沈嗎？臉上長黑斑、有皮下脂肪瘤？便物顏色深、乾、硬？情緒容易暴躁、易怒、無名火等等。",
        "要擁有溫暖體質，其實不難，只要忌口造成體質惡化的食物再加上認真喝薑汁和攝取優質蛋白質就可以了。但到底哪些食物會影響身體該忌口呢？\n\n忌口寒性食物\n蔬菜類：大白菜、小白菜、大黃瓜、苦瓜、絲瓜、冬瓜、地瓜葉、白蘿菠、秋葵。\n料理類：生菜沙拉、生魚片等生食\n\n第一步先避開寒性食物後，接著第二步，就是要好好認識哪些食物是會讓你身體上火的。根據身體不同的器官，上火的症狀和需要避開的食物也都不同",
        "內火有肝火和腸火。首先談談肝火，如果肝火過旺，你肯定會有睡眠的問題，不論是失眠、淺眠還是多夢，都與肝火有關。另外，肝火也會引發皮膚過敏。還有，早上起床時不時有眼屎，眼睛有乾、酸、癢的問題？會不會長針眼？有沒有嘴破手腳及臉部皮膚顏色會有暗沈嗎？臉上長黑斑、有皮下脂肪瘤？便物顏色深、乾、硬？情緒容易暴躁、易怒、無名火等等。",
        "內火有肝火和腸火。首先談談肝火，如果肝火過旺，你肯定會有睡眠的問題，不論是失眠、淺眠還是多夢，都與肝火有關。另外，肝火也會引發皮膚過敏。還有，早上起床時不時有眼屎，眼睛有乾、酸、癢的問題？會不會長針眼？有沒有嘴破手腳及臉部皮膚顏色會有暗沈嗎？臉上長黑斑、有皮下脂肪瘤？便物顏色深、乾、硬？情緒容易暴躁、易怒、無名火等等。",
        "要擁有溫暖體質，其實不難，只要忌口造成體質惡化的食物再加上認真喝薑汁和攝取優質蛋白質就可以了。但到底哪些食物會影響身體該忌口呢？\n\n忌口寒性食物\n蔬菜類：大白菜、小白菜、大黃瓜、苦瓜、絲瓜、冬瓜、地瓜葉、白蘿菠、秋葵。\n料理類：生菜沙拉、生魚片等生食\n\n第一步先避開寒性食物後，接著第二步，就是要好好認識哪些食物是會讓你身體上火的。根據身體不同的器官，上火的症狀和需要避開的食物也都不同",
        "要擁有溫暖體質，其實不難，只要忌口造成體質惡化的食物再加上認真喝薑汁和攝取優質蛋白質就可以了。但到底哪些食物會影響身體該忌口呢？\n\n忌口寒性食物\n蔬菜類：大白菜、小白菜、大黃瓜、苦瓜、絲瓜、冬瓜、地瓜葉、白蘿菠、秋葵。\n料理類：生菜沙拉、生魚片等生食\n\n第一步先避開寒性食物後，接著第二步，就是要好好認識哪些食物是會讓你身體上火的。根據身體不同的器官，上火的症狀和需要避開的食物也都不同",
        "要擁有溫暖體質，其實不難，只要忌口造成體質惡化的食物再加上認真喝薑汁和攝取優質蛋白質就可以了。但到底哪些食物會影響身體該忌口呢？\n\n忌口寒性食物\n蔬菜類：大白菜、小白菜、大黃瓜、苦瓜、絲瓜、冬瓜、地瓜葉、白蘿菠、秋葵。\n料理類：生菜沙拉、生魚片等生食\n\n第一步先避開寒性食物後，接著第二步，就是要好好認識哪些食物是會讓你身體上火的。根據身體不同的器官，上火的症狀和需要避開的食物也都不同",
        "奶類及其加工製品過敏體質的吃法",
        "蛋過敏體質的吃法",
        "黃豆及其加工製品過敏體質的吃法",
        "五穀雜糧過敏體質的吃法",
        "牛肉過敏體質的吃法",
    ]
    
    let allergyArray: [String] = [
        "建議忌口寒食、早餐前喝薑汁、三餐認真擇食",
        "建議忌口上肝火食物、三餐認真擇食、不熬夜、做好情緒調整",
        "建議忌口寒性、上火食物、早餐前喝薑汁、三餐認真擇食、不熬夜、做好情緒調整",
        "建議忌口上胃火食物、甜食、五穀雜糧、奶製品、黃豆製品、糯米類、足筍類、三餐定時定量、每一口食物嚼30下",
        "建議忌口上腸火食物、蛋類製品、蒜頭(包括蒜苗)、韭菜(包括韭黃)、蝦子(包括蝦米、龍蝦)、奶製品",
        "建議認真攝取優質蛋白和抗性澱粉",
        "建議認真攝取含鈣食物和檸檬酸鈣，忌口刺激神經的食物",
        "建議忌口上肝火食物",
        "建議嚴格忌口奶類及其加工製品至少一年",
        "建議嚴格忌口蛋類製品至少一年",
        "建議嚴格忌口黃豆及其加工製品至少一年",
        "建議嚴格忌口五穀雜糧至少一年",
        "建議嚴格忌口牛肉至少一年"
    ]
    
    //每個體質所包含的症狀
    let SymInPhy:[[Int]] = [[0,1,2,3,4,5,6,7,8,9],
                            [10,11,12,13,14,15,16,17,18,19,20,21],
                            [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21],
                            [22,23,24,25,26,27,28,29,30,31],
                            [32,33,34,35,36,37,38,39],
                            [40,41,42,44,43,45,46],
                            [47,48,49,50,51,52,53,54,55,56],
                            [57,58,59,60,6,3],
                            [32,56,61,62,63,64,65,66,67,28],
                            [8,16,68,69,70,63,35,71,72,73,74,65,75,76,77,78,79,80,81,82,66,13,52],
                            [83,84,85,28,24,22,26,68,63,86,87,88,25],
                            [2,22,25,26,67,70],
                            [8,13,89,90]
    ]
}
